[
    {
      "title": "IOC implements AI for athlete safety at Paris Olympics",
      "subtitle": "Despite upcoming snap parliamentary elections in France, the IOC remains confident that preparations and the Games will proceed without disruption.",
      "cover": "https://diplo-media.s3.eu-central-1.amazonaws.com/2024/06/contest-1227639_1280-1024x686.jpg",
      "description": "The International Olympic Committee (IOC) will deploy AI to combat social media abuse directed at 15,000 athletes and officials during the Paris Olympics next month, IOC President Thomas Bach announced on Friday. With the Games set to begin on 26 July, more than 10,500 athletes will compete across 32 sports, generating over half a billion social media engagements.\n\nThe AI system aims to safeguard athletes by monitoring and automatically erasing abusive posts to provide extensive protection against cyber abuse. That initiative comes amid ongoing global conflicts, including the wars in Ukraine and Gaza, which have already led to social media abuse cases.\n\nRussian and Belarusian athletes, who will compete as neutral athletes without their national flags, are included in the protective measures. The IOC did not specify the level of access athletes would need to grant for the AI monitoring.\n\nDespite recent political developments in France, including a snap parliamentary election called by President Emmanuel Macron, Bach assured that preparations for the Olympics remain on track. He emphasised that both the government and opposition are determined to ensure that France presents itself well during the Games.",
      "tags": ["AI", "Olympics", "Athlete Safety", "Social Media", "Paris Olympics"],
      "date": "2024-06-15"
    },
    {
      "title": "Clearview AI reaches unusual settlement in privacy lawsuit",
      "subtitle": "The settlement is based on a theoretical stake in the company’s future value, potentially amounting to at least $50 million, including $20 million in attorney fees.",
      "cover": "https://diplo-media.s3.eu-central-1.amazonaws.com/2024/06/handshake-after-a-lawsuit-settlement-was-agreed-no-faces-just-the-handshake-1024x585.jpg",
      "description": "Facial recognition company Clearview AI has reached a groundbreaking class action settlement to address allegations of violating the privacy rights of millions of Americans. Filed in Chicago federal court on Wednesday, the agreement is notably unconventional as it does not specify a monetary payout upfront. Instead, it ties compensation to Clearview AI’s future financial outcomes, such as its potential IPO or merger valuation.\n\nThe lawsuit, rooted in Clearview AI’s alleged scraping of billions of facial images from the internet without consent, invoked Illinois’ biometric privacy law. Although Clearview denies any wrongdoing, the proposed settlement now awaits approval from US District Judge Sharon Johnson Coleman.\n\nIn a related development earlier this year, Clearview AI agreed with the ACLU to restrict access to its facial recognition database for private entities and government agencies in Illinois for five years. The plaintiffs’ attorneys acknowledged that this prior agreement influenced their approach to the class action settlement, adopting a structure that allows class members to share in potential future profits of Clearview AI.\n\nThe novel settlement approach, spearheaded by Loevy & Loevy, aims to provide meaningful relief to affected individuals while navigating Clearview AI’s financial constraints. Attorney Jon Loevy highlighted that this solution allows class members to reclaim some ownership over their biometric data, reflecting a unique attempt to compensate for privacy violations in the digital age.",
      "tags": ["Clearview AI", "Privacy Lawsuit", "Facial Recognition", "Legal Settlement"],
      "date": "2024-06-15"
    },
    {
      "title": "Microsoft’s €6.69 billion investment in Aragon computing hub",
      "subtitle": "Microsoft’s move follows Amazon’s recent announcement of a €15.7 billion investment in data centres in the same region, which will be powered fully by renewable energy.",
      "cover": "https://diplo-media.s3.eu-central-1.amazonaws.com/2024/02/1524167e-54ef-4a3f-a7f3-00814510c175.jpg",
      "description": "Microsoft plans to invest 6.69 billion euros ($7.16 billion) in developing new data centres in Spain’s northeastern region of Aragon, enhancing the area’s reputation as a major European cloud computing hub. The regional government confirmed that Microsoft had applied for a construction permit for data centres outside Zaragoza, with the investment spread over ten years. The initiative follows Microsoft’s recent announcement of a 2.1 billion euro investment in data centres in Madrid.\n\nAmazon Web Services (AWS) also has significant plans for Aragon, having announced a 15.7 billion euro investment over the next decade to build renewable energy-powered data centres in the region. Zaragoza, Spain’s fifth-largest city, is a logistics and transportation hub strategically positioned between Madrid and Barcelona along the key trade route connecting the Iberian Peninsula to France and the rest of Europe. The geographical advantage and Aragon’s substantial wind power capacity make it an attractive location for significant tech investments.",
      "tags": ["Microsoft", "Aragon", "Cloud Computing", "Data Centres", "Investment"],
      "date": "2024-06-15"
    },
    {
      "title": "Trial scheduled for April in Musk’s X lawsuit against Media Matters",
      "subtitle": "The company argues that the watchdog’s research methodology is flawed and distorts the likelihood of encountering such extremist material, claiming this unfairly damages X’s reputation.",
      "cover": "https://diplo-media.s3.eu-central-1.amazonaws.com/2023/04/wooden-court-hammer-on-the-table--1024x682.jpg",
      "description": "A lawsuit filed by Elon Musk’s company X against Media Matters, scheduled for trial in April 2025, marks the latest development in a contentious legal battle. The US District Court for the Northern District of Texas set this date following allegations from X that Media Matters misrepresented the prevalence of hate speech on social media platforms, specifically targeting content on X’s platform.\n\nMedia Matters, a nonprofit watchdog group, has been accused by X of distorting data and exaggerating the likelihood of encountering extremist content. X claims that Media Matters’ methodology does not accurately reflect real user experiences, prompting a legal challenge that has garnered significant attention.\n\nIn response to Thursday’s court order, neither X nor Media Matters provided immediate comments. However, Media Matters President Angelo Carusone previously denounced the lawsuit as baseless and an attempt to stifle criticism of Elon Musk. Motions for summary judgment are expected by December, with a decision potentially influencing the case’s outcome before it reaches trial.\n\nThe lawsuit is part of a broader pattern for Musk, who has faced legal setbacks in similar cases aiming to challenge watchdog groups. Earlier this year, a federal judge in California dismissed a lawsuit by X against the Center for Countering Digital Hate, criticising it as retaliatory rather than protective of platform integrity. The outcome of these legal battles could affect how social media platforms and watchdog organisations navigate issues of content moderation and free speech moving forward.",
      "tags": ["Elon Musk", "Media Matters", "Lawsuit", "Trial", "Hate Speech"],
      "date": "2024-06-15"
    },
    {
      "title": "LinkedIn unveils AI-driven features to enhance job hunting and recruitment",
      "subtitle": "The move highlights the transformative potential of AI in professional networking, benefiting both job seekers and employers.",
      "cover": "https://diplo-media.s3.eu-central-1.amazonaws.com/2024/06/linkedin.jpg",
      "description": "LinkedIn is using AI to streamline the job hunting process, aiming to alleviate the task of job searching for its users. The professional networking giant announced a suite of AI-driven features designed to match job seekers with opportunities more efficiently, ensuring that both employers and potential employees find the best fit with minimal effort. “We’ve been building with AI since 2007. We use it heavily for connecting people… for defense and how we keep trust in the ecosystem. It’s one of our most powerful tools,” its head of product, Tomer Cohen, said in an interview.\n\nCentral to LinkedIn’s new offerings is an AI-powered recommendation engine that analyses user profiles, past job searches, and application history to suggest relevant job openings. The tool not only personalizes job recommendations but also learns from user interactions to refine its suggestions over time. LinkedIn’s goal is to significantly reduce the time and effort required for job seekers to find suitable roles, increasing the chances of matching them with positions that align closely with their skills and career aspirations.\n\nLinkedIn is also rolling out AI tools designed to assist users in crafting more effective resumes and cover letters. These tools provide real-time feedback, highlighting key areas for improvement and suggesting changes to better align documents with job descriptions. By leveraging natural language processing, LinkedIn aims to help job seekers present their qualifications in the best possible light, ultimately increasing their chances of securing interviews.\n\nTo further support job seekers, LinkedIn is introducing AI-enhanced skill assessments and training modules. These features allow users to identify gaps in their skill sets and access personalized learning resources to address these deficiencies. The AI system recommends specific courses and certifications that can improve a user’s profile, making them more attractive to potential employers.\n\nIn addition to its AI-driven tools, LinkedIn is expanding the availability of Recruiter 2024, a comprehensive recruitment platform that leverages AI to help companies find and engage top talent more effectively. The platform will now include more tools for marketers, enabling them to reach and connect with their target audiences more efficiently. LinkedIn is also introducing enhanced premium company pages for small businesses, providing them with advanced features to showcase their brand and attract potential employees.",
      "tags": ["LinkedIn", "AI", "Job Hunting", "Recruitment", "Professional Networking"],
      "date": "2024-06-15"
    },
    {
      "title": "Microsoft delays AI ‘Recall’ feature amid privacy concerns",
      "subtitle": "The decision follows public fears about potential spying and criticism from figures like Elon Musk",
      "cover": "https://diplo-media.s3.eu-central-1.amazonaws.com/2024/06/building-1011876_1280-1024x768.jpg",
      "description": "Microsoft has decided to delay the rollout of its AI-powered ‘Recall’ feature, which tracks and stores computer usage histories, citing privacy concerns. Initially planned for launch with new computers next week, Recall will now undergo a preview phase within its Windows Insider Program (WIP) in the coming weeks rather than being widely available to Copilot+ PC users starting 18 June.\n\nThe Recall feature, designed to record everything from web browsing to voice chats for later retrieval, aims to help users remember past activities even months later. Microsoft emphasised that the delay is part of their commitment to ensuring a trusted and secure customer experience, seeking additional feedback before a broader release.\n\nCopilot+ PCs, introduced in May, integrate AI capabilities and were set to include Recall as a key feature. The WIP, which allows enthusiastic users to test upcoming Windows features, will play a crucial role in gathering feedback on Recall before its eventual wider availability.\n\nPrivacy concerns surfaced swiftly after Recall’s announcement, with critics suggesting potential misuse for surveillance purposes. Elon Musk likened the feature to a scenario from the dystopian TV series ‘Black Mirror’, reflecting broader anxieties about the implications of pervasive technology on personal privacy and security.",
      "tags": ["Microsoft", "AI", "Recall Feature", "Privacy Concerns", "Technology"],
      "date": "2024-06-15"
    },
    {
      "title": "IOC implements AI for athlete safety at Paris Olympics",
      "subtitle": "Despite upcoming snap parliamentary elections in France, the IOC remains confident that preparations and the Games will proceed without disruption.",
      "cover": "https://diplo-media.s3.eu-central-1.amazonaws.com/2024/06/contest-1227639_1280-1024x686.jpg",
      "description": "The International Olympic Committee (IOC) will deploy AI to combat social media abuse directed at 15,000 athletes and officials during the Paris Olympics next month, IOC President Thomas Bach announced on Friday. With the Games set to begin on 26 July, more than 10,500 athletes will compete across 32 sports, generating over half a billion social media engagements.\n\nThe AI system aims to safeguard athletes by monitoring and automatically erasing abusive posts to provide extensive protection against cyber abuse. That initiative comes amid ongoing global conflicts, including the wars in Ukraine and Gaza, which have already led to social media abuse cases.\n\nRussian and Belarusian athletes, who will compete as neutral athletes without their national flags, are included in the protective measures. The IOC did not specify the level of access athletes would need to grant for the AI monitoring.\n\nDespite recent political developments in France, including a snap parliamentary election called by President Emmanuel Macron, Bach assured that preparations for the Olympics remain on track. He emphasised that both the government and opposition are determined to ensure that France presents itself well during the Games.",
      "tags": ["AI", "Olympics", "Athlete Safety", "Social Media", "Paris Olympics"],
      "date": "2024-06-15"
    },
    {
      "title": "Clearview AI reaches unusual settlement in privacy lawsuit",
      "subtitle": "The settlement is based on a theoretical stake in the company’s future value, potentially amounting to at least $50 million, including $20 million in attorney fees.",
      "cover": "https://diplo-media.s3.eu-central-1.amazonaws.com/2024/06/handshake-after-a-lawsuit-settlement-was-agreed-no-faces-just-the-handshake-1024x585.jpg",
      "description": "Facial recognition company Clearview AI has reached a groundbreaking class action settlement to address allegations of violating the privacy rights of millions of Americans. Filed in Chicago federal court on Wednesday, the agreement is notably unconventional as it does not specify a monetary payout upfront. Instead, it ties compensation to Clearview AI’s future financial outcomes, such as its potential IPO or merger valuation.\n\nThe lawsuit, rooted in Clearview AI’s alleged scraping of billions of facial images from the internet without consent, invoked Illinois’ biometric privacy law. Although Clearview denies any wrongdoing, the proposed settlement now awaits approval from US District Judge Sharon Johnson Coleman.\n\nIn a related development earlier this year, Clearview AI agreed with the ACLU to restrict access to its facial recognition database for private entities and government agencies in Illinois for five years. The plaintiffs’ attorneys acknowledged that this prior agreement influenced their approach to the class action settlement, adopting a structure that allows class members to share in potential future profits of Clearview AI.\n\nThe novel settlement approach, spearheaded by Loevy & Loevy, aims to provide meaningful relief to affected individuals while navigating Clearview AI’s financial constraints. Attorney Jon Loevy highlighted that this solution allows class members to reclaim some ownership over their biometric data, reflecting a unique attempt to compensate for privacy violations in the digital age.",
      "tags": ["Clearview AI", "Privacy Lawsuit", "Facial Recognition", "Legal Settlement"],
      "date": "2024-06-15"
    }
  ]
  